In [1]:
import pandas as pd

In [5]:
data = {'Name':['Jai','Raju','Kishan','Raj','Shaam'],'Age':[22,26,28,24,29],
        'Qualification':['B.E','B.Tech','EXTC','BSC','B.Com']}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

     Name  Age Qualification
0     Jai   22           B.E
1    Raju   26        B.Tech
2  Kishan   28          EXTC
3     Raj   24           BSC
4   Shaam   29         B.Com

In [8]:
df.groupby('Name')

In [9]:
print(df.groupby('Name').groups)

{'Jai': Int64Index([0], dtype='int64'), 'Kishan': Int64Index([2], dtype='int64'), 'Raj': Int64Index([3], dtype='int64'), 'Raju': Int64Index([1], dtype='int64'), 'Shaam': Int64Index([4], dtype='int64')}

In [10]:
grp=df.groupby('Name')

In [11]:
for name, group in grp:
    print(name)
    print(group)
    print()

Jai
  Name  Age Qualification
0  Jai   22           B.E

Kishan
     Name  Age Qualification
2  Kishan   28          EXTC

Raj
  Name  Age Qualification
3  Raj   24           BSC

Raju
   Name  Age Qualification
1  Raju   26        B.Tech

Shaam
    Name  Age Qualification
4  Shaam   29         B.Com

In [12]:
grp=df.groupby(['Name','Qualification'])

In [13]:
for name, group in grp:
    print(name)
    print(group)

('Jai', 'B.E')
  Name  Age Qualification
0  Jai   22           B.E
('Kishan', 'EXTC')
     Name  Age Qualification
2  Kishan   28          EXTC
('Raj', 'BSC')
  Name  Age Qualification
3  Raj   24           BSC
('Raju', 'B.Tech')
   Name  Age Qualification
1  Raju   26        B.Tech
('Shaam', 'B.Com')
    Name  Age Qualification
4  Shaam   29         B.Com

In [14]:
grp=df.groupby('Name')

In [15]:
grp.get_group('Jai')

  Name  Age Qualification
0  Jai   22           B.E

In [19]:
grp=df.groupby(['Name','Qualification'])

grp.get_group(('Kishan','EXTC'))